Revit 2027 API
GeometryElement.GetTransformed Method
Returns a transformed copy of the geometry in this element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public GeometryElement GetTransformed(
	Transform transform
)
Public Function GetTransformed (
	transform As Transform
) As GeometryElement
public:
GeometryElement^ GetTransformed(
	Transform^ transform
)
member GetTransformed :
        transform : Transform -> GeometryElement
Parameters
transform Transform
The transformation to apply to the geometry.
Return Value
GeometryElement
Exceptions
Exception | Condition
ArgumentException | Transform is not conformal
See Also
Reference
GeometryElement Class
Autodesk.Revit.DB Namespace